examples/porousHeatTransferFoam/energyRelease/sutherlandViscosity/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

energyRelease
{
    type            scalarSemiImplicitSource;

    selectionMode   all;
//	cellZone        heatSource;
	
	Q 1e5;

	volumeMode      specific;

    injectionRateSuSp
    {
        h.solid           (#eval "(1 - 0.3) * $Q" 0);
    }
}

// ************************************************************************* //
