examples/porousHeatTransferFoam/energyRelease/sutherlandViscosity/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

a				0.3;
chi				0.5;
KD				1.0e8; // 1 / k
F				0.0;

HTcoef			1.0e3;

rhoS			2200.0;
cS				920.0;
lambdaS			1.2;

// ************************************************************************* //
